{"class_name": "Tokenizer", "config": {"num_words": 5000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 4000, "word_counts": "{\"standard\": 263, \"tablet\": 190, \"features\": 165, \"webcam\": 186, \"as\": 305, \"expected\": 285, \"not\": 814, \"bad\": 383, \"speaker\": 211, \"decent\": 245, \"for\": 435, \"the\": 641, \"price\": 268, \"monitor\": 197, \"great\": 433, \"this\": 978, \"microphone\": 196, \"is\": 563, \"okay\": 155, \"fantastic\": 145, \"exceeded\": 142, \"my\": 308, \"expectations\": 142, \"regular\": 127, \"smartphone\": 195, \"best\": 123, \"powerbank\": 187, \"i've\": 123, \"ever\": 235, \"used\": 123, \"exactly\": 130, \"what\": 130, \"i\": 279, \"wanted\": 130, \"useless\": 127, \"charger\": 204, \"terrible\": 249, \"experience\": 121, \"waste\": 259, \"of\": 259, \"money\": 402, \"on\": 130, \"very\": 378, \"disappointed\": 127, \"with\": 270, \"premium\": 15, \"feel\": 15, \"better\": 274, \"than\": 145, \"disappointing\": 122, \"described\": 165, \"mouse\": 194, \"regret\": 255, \"buying\": 141, \"keyboard\": 192, \"stay\": 123, \"away\": 123, \"from\": 123, \"worst\": 112, \"basic\": 285, \"camera\": 185, \"acceptable\": 282, \"laptop\": 232, \"horrible\": 142, \"printer\": 216, \"memory\": 212, \"card\": 212, \"amazing\": 167, \"usual\": 112, \"cable\": 202, \"complete\": 129, \"would\": 121, \"recommend\": 121, \"fine\": 128, \"meets\": 133, \"requirements\": 133, \"router\": 221, \"quality\": 525, \"superb\": 125, \"love\": 149, \"headphones\": 208, \"will\": 145, \"buy\": 145, \"again\": 145, \"earphones\": 197, \"serves\": 134, \"its\": 134, \"purpose\": 134, \"could\": 129, \"be\": 240, \"hard\": 177, \"drive\": 177, \"poor\": 257, \"average\": 255, \"battery\": 21, \"life\": 21, \"couldn't\": 111, \"happier\": 111, \"awful\": 136, \"nothing\": 125, \"special\": 125, \"brilliant\": 133, \"worth\": 292, \"every\": 150, \"penny\": 150, \"performance\": 24, \"wonderful\": 131, \"excellent\": 168, \"value\": 143, \"crystal\": 9, \"clear\": 9, \"display\": 9, \"outstanding\": 138, \"purchase\": 245, \"perfect\": 166, \"needs\": 166, \"smartwatch\": 198, \"satisfied\": 131, \"highly\": 127, \"recommended\": 127, \"beautiful\": 12, \"design\": 12, \"comfortable\": 10, \"to\": 10, \"use\": 10, \"misleading\": 120, \"innovative\": 19, \"fast\": 16, \"processing\": 16, \"build\": 13, \"reliable\": 9}", "word_docs": "{\"tablet\": 190, \"features\": 165, \"standard\": 248, \"expected\": 285, \"as\": 305, \"webcam\": 186, \"speaker\": 211, \"the\": 628, \"not\": 676, \"price\": 268, \"bad\": 375, \"for\": 435, \"decent\": 235, \"monitor\": 197, \"great\": 394, \"this\": 943, \"is\": 563, \"okay\": 155, \"microphone\": 196, \"expectations\": 142, \"exceeded\": 142, \"fantastic\": 145, \"my\": 308, \"smartphone\": 195, \"regular\": 127, \"powerbank\": 187, \"used\": 123, \"i've\": 123, \"ever\": 235, \"exactly\": 130, \"what\": 130, \"i\": 267, \"wanted\": 130, \"best\": 123, \"terrible\": 244, \"experience\": 121, \"useless\": 127, \"charger\": 204, \"very\": 378, \"waste\": 243, \"money\": 386, \"on\": 130, \"of\": 243, \"disappointed\": 127, \"with\": 261, \"premium\": 15, \"better\": 274, \"than\": 145, \"feel\": 15, \"disappointing\": 122, \"described\": 165, \"mouse\": 194, \"from\": 123, \"away\": 123, \"buying\": 141, \"regret\": 243, \"stay\": 123, \"keyboard\": 192, \"worst\": 112, \"basic\": 273, \"camera\": 185, \"acceptable\": 268, \"laptop\": 232, \"printer\": 216, \"horrible\": 142, \"memory\": 212, \"card\": 212, \"amazing\": 167, \"usual\": 112, \"cable\": 202, \"complete\": 129, \"recommend\": 121, \"would\": 121, \"requirements\": 133, \"meets\": 133, \"fine\": 128, \"quality\": 508, \"router\": 221, \"superb\": 125, \"again\": 145, \"love\": 149, \"buy\": 145, \"headphones\": 208, \"will\": 145, \"purpose\": 134, \"earphones\": 197, \"its\": 134, \"serves\": 134, \"could\": 129, \"be\": 240, \"poor\": 240, \"hard\": 177, \"drive\": 177, \"average\": 241, \"life\": 21, \"battery\": 21, \"couldn't\": 111, \"happier\": 111, \"awful\": 136, \"nothing\": 125, \"special\": 125, \"penny\": 150, \"every\": 150, \"brilliant\": 133, \"worth\": 292, \"performance\": 24, \"wonderful\": 131, \"excellent\": 168, \"value\": 143, \"display\": 9, \"clear\": 9, \"crystal\": 9, \"outstanding\": 138, \"purchase\": 245, \"needs\": 166, \"perfect\": 166, \"smartwatch\": 198, \"satisfied\": 131, \"recommended\": 127, \"highly\": 127, \"beautiful\": 12, \"design\": 12, \"comfortable\": 10, \"use\": 10, \"to\": 10, \"misleading\": 120, \"innovative\": 19, \"processing\": 16, \"fast\": 16, \"build\": 13, \"reliable\": 9}", "index_docs": "{\"48\": 190, \"58\": 165, \"21\": 248, \"14\": 285, \"12\": 305, \"50\": 186, \"37\": 211, \"3\": 628, \"2\": 676, \"20\": 268, \"9\": 375, \"6\": 435, \"28\": 235, \"42\": 197, \"7\": 394, \"1\": 943, \"4\": 563, \"60\": 155, \"44\": 196, \"71\": 142, \"70\": 142, \"64\": 145, \"11\": 308, \"45\": 195, \"91\": 127, \"49\": 187, \"101\": 123, \"100\": 123, \"31\": 235, \"84\": 130, \"85\": 130, \"17\": 267, \"86\": 130, \"99\": 123, \"27\": 244, \"106\": 121, \"92\": 127, \"39\": 204, \"10\": 378, \"22\": 243, \"8\": 386, \"87\": 130, \"23\": 243, \"93\": 127, \"19\": 261, \"120\": 15, \"18\": 274, \"65\": 145, \"121\": 15, \"105\": 122, \"59\": 165, \"46\": 194, \"104\": 123, \"103\": 123, \"73\": 141, \"25\": 243, \"102\": 123, \"47\": 192, \"110\": 112, \"15\": 273, \"51\": 185, \"16\": 268, \"32\": 232, \"34\": 216, \"72\": 142, \"35\": 212, \"36\": 212, \"55\": 167, \"111\": 112, \"40\": 202, \"88\": 129, \"108\": 121, \"107\": 121, \"80\": 133, \"79\": 133, \"90\": 128, \"5\": 508, \"33\": 221, \"96\": 125, \"68\": 145, \"63\": 149, \"67\": 145, \"38\": 208, \"66\": 145, \"78\": 134, \"43\": 197, \"77\": 134, \"76\": 134, \"89\": 129, \"30\": 240, \"24\": 240, \"52\": 177, \"53\": 177, \"26\": 241, \"116\": 21, \"115\": 21, \"112\": 111, \"113\": 111, \"75\": 136, \"97\": 125, \"98\": 125, \"62\": 150, \"61\": 150, \"81\": 133, \"13\": 292, \"114\": 24, \"82\": 131, \"54\": 168, \"69\": 143, \"130\": 9, \"129\": 9, \"128\": 9, \"74\": 138, \"29\": 245, \"57\": 166, \"56\": 166, \"41\": 198, \"83\": 131, \"95\": 127, \"94\": 127, \"123\": 12, \"124\": 12, \"125\": 10, \"127\": 10, \"126\": 10, \"109\": 120, \"117\": 19, \"119\": 16, \"118\": 16, \"122\": 13, \"131\": 9}", "index_word": "{\"1\": \"this\", \"2\": \"not\", \"3\": \"the\", \"4\": \"is\", \"5\": \"quality\", \"6\": \"for\", \"7\": \"great\", \"8\": \"money\", \"9\": \"bad\", \"10\": \"very\", \"11\": \"my\", \"12\": \"as\", \"13\": \"worth\", \"14\": \"expected\", \"15\": \"basic\", \"16\": \"acceptable\", \"17\": \"i\", \"18\": \"better\", \"19\": \"with\", \"20\": \"price\", \"21\": \"standard\", \"22\": \"waste\", \"23\": \"of\", \"24\": \"poor\", \"25\": \"regret\", \"26\": \"average\", \"27\": \"terrible\", \"28\": \"decent\", \"29\": \"purchase\", \"30\": \"be\", \"31\": \"ever\", \"32\": \"laptop\", \"33\": \"router\", \"34\": \"printer\", \"35\": \"memory\", \"36\": \"card\", \"37\": \"speaker\", \"38\": \"headphones\", \"39\": \"charger\", \"40\": \"cable\", \"41\": \"smartwatch\", \"42\": \"monitor\", \"43\": \"earphones\", \"44\": \"microphone\", \"45\": \"smartphone\", \"46\": \"mouse\", \"47\": \"keyboard\", \"48\": \"tablet\", \"49\": \"powerbank\", \"50\": \"webcam\", \"51\": \"camera\", \"52\": \"hard\", \"53\": \"drive\", \"54\": \"excellent\", \"55\": \"amazing\", \"56\": \"perfect\", \"57\": \"needs\", \"58\": \"features\", \"59\": \"described\", \"60\": \"okay\", \"61\": \"every\", \"62\": \"penny\", \"63\": \"love\", \"64\": \"fantastic\", \"65\": \"than\", \"66\": \"will\", \"67\": \"buy\", \"68\": \"again\", \"69\": \"value\", \"70\": \"exceeded\", \"71\": \"expectations\", \"72\": \"horrible\", \"73\": \"buying\", \"74\": \"outstanding\", \"75\": \"awful\", \"76\": \"serves\", \"77\": \"its\", \"78\": \"purpose\", \"79\": \"meets\", \"80\": \"requirements\", \"81\": \"brilliant\", \"82\": \"wonderful\", \"83\": \"satisfied\", \"84\": \"exactly\", \"85\": \"what\", \"86\": \"wanted\", \"87\": \"on\", \"88\": \"complete\", \"89\": \"could\", \"90\": \"fine\", \"91\": \"regular\", \"92\": \"useless\", \"93\": \"disappointed\", \"94\": \"highly\", \"95\": \"recommended\", \"96\": \"superb\", \"97\": \"nothing\", \"98\": \"special\", \"99\": \"best\", \"100\": \"i've\", \"101\": \"used\", \"102\": \"stay\", \"103\": \"away\", \"104\": \"from\", \"105\": \"disappointing\", \"106\": \"experience\", \"107\": \"would\", \"108\": \"recommend\", \"109\": \"misleading\", \"110\": \"worst\", \"111\": \"usual\", \"112\": \"couldn't\", \"113\": \"happier\", \"114\": \"performance\", \"115\": \"battery\", \"116\": \"life\", \"117\": \"innovative\", \"118\": \"fast\", \"119\": \"processing\", \"120\": \"premium\", \"121\": \"feel\", \"122\": \"build\", \"123\": \"beautiful\", \"124\": \"design\", \"125\": \"comfortable\", \"126\": \"to\", \"127\": \"use\", \"128\": \"crystal\", \"129\": \"clear\", \"130\": \"display\", \"131\": \"reliable\"}", "word_index": "{\"this\": 1, \"not\": 2, \"the\": 3, \"is\": 4, \"quality\": 5, \"for\": 6, \"great\": 7, \"money\": 8, \"bad\": 9, \"very\": 10, \"my\": 11, \"as\": 12, \"worth\": 13, \"expected\": 14, \"basic\": 15, \"acceptable\": 16, \"i\": 17, \"better\": 18, \"with\": 19, \"price\": 20, \"standard\": 21, \"waste\": 22, \"of\": 23, \"poor\": 24, \"regret\": 25, \"average\": 26, \"terrible\": 27, \"decent\": 28, \"purchase\": 29, \"be\": 30, \"ever\": 31, \"laptop\": 32, \"router\": 33, \"printer\": 34, \"memory\": 35, \"card\": 36, \"speaker\": 37, \"headphones\": 38, \"charger\": 39, \"cable\": 40, \"smartwatch\": 41, \"monitor\": 42, \"earphones\": 43, \"microphone\": 44, \"smartphone\": 45, \"mouse\": 46, \"keyboard\": 47, \"tablet\": 48, \"powerbank\": 49, \"webcam\": 50, \"camera\": 51, \"hard\": 52, \"drive\": 53, \"excellent\": 54, \"amazing\": 55, \"perfect\": 56, \"needs\": 57, \"features\": 58, \"described\": 59, \"okay\": 60, \"every\": 61, \"penny\": 62, \"love\": 63, \"fantastic\": 64, \"than\": 65, \"will\": 66, \"buy\": 67, \"again\": 68, \"value\": 69, \"exceeded\": 70, \"expectations\": 71, \"horrible\": 72, \"buying\": 73, \"outstanding\": 74, \"awful\": 75, \"serves\": 76, \"its\": 77, \"purpose\": 78, \"meets\": 79, \"requirements\": 80, \"brilliant\": 81, \"wonderful\": 82, \"satisfied\": 83, \"exactly\": 84, \"what\": 85, \"wanted\": 86, \"on\": 87, \"complete\": 88, \"could\": 89, \"fine\": 90, \"regular\": 91, \"useless\": 92, \"disappointed\": 93, \"highly\": 94, \"recommended\": 95, \"superb\": 96, \"nothing\": 97, \"special\": 98, \"best\": 99, \"i've\": 100, \"used\": 101, \"stay\": 102, \"away\": 103, \"from\": 104, \"disappointing\": 105, \"experience\": 106, \"would\": 107, \"recommend\": 108, \"misleading\": 109, \"worst\": 110, \"usual\": 111, \"couldn't\": 112, \"happier\": 113, \"performance\": 114, \"battery\": 115, \"life\": 116, \"innovative\": 117, \"fast\": 118, \"processing\": 119, \"premium\": 120, \"feel\": 121, \"build\": 122, \"beautiful\": 123, \"design\": 124, \"comfortable\": 125, \"to\": 126, \"use\": 127, \"crystal\": 128, \"clear\": 129, \"display\": 130, \"reliable\": 131}"}}