"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": 10000, \"filters\": \"!\\\"#$%&()*+,-./:;<=>?@[\\\\]^_`{|}~\\t\\n\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": null, \"document_count\": 3200, \"word_counts\": \"{\\\"wonderful\\\": 106, \\\"printer\\\": 175, \\\"exceeded\\\": 113, \\\"my\\\": 246, \\\"expectations\\\": 113, \\\"fantastic\\\": 115, \\\"speaker\\\": 157, \\\"perfect\\\": 133, \\\"for\\\": 352, \\\"needs\\\": 133, \\\"acceptable\\\": 230, \\\"headphones\\\": 163, \\\"quality\\\": 422, \\\"standard\\\": 211, \\\"earphones\\\": 163, \\\"nothing\\\": 100, \\\"special\\\": 100, \\\"regret\\\": 197, \\\"buying\\\": 114, \\\"this\\\": 790, \\\"webcam\\\": 153, \\\"would\\\": 95, \\\"not\\\": 644, \\\"recommend\\\": 95, \\\"horrible\\\": 111, \\\"very\\\": 322, \\\"disappointed\\\": 109, \\\"bad\\\": 300, \\\"laptop\\\": 193, \\\"decent\\\": 200, \\\"the\\\": 521, \\\"price\\\": 217, \\\"usual\\\": 81, \\\"memory\\\": 163, \\\"card\\\": 163, \\\"as\\\": 237, \\\"expected\\\": 224, \\\"poor\\\": 206, \\\"monitor\\\": 156, \\\"terrible\\\": 195, \\\"experience\\\": 90, \\\"camera\\\": 148, \\\"is\\\": 456, \\\"fine\\\": 108, \\\"charger\\\": 154, \\\"features\\\": 133, \\\"worth\\\": 242, \\\"worst\\\": 94, \\\"ever\\\": 187, \\\"complete\\\": 108, \\\"waste\\\": 211, \\\"of\\\": 211, \\\"money\\\": 329, \\\"regular\\\": 100, \\\"microphone\\\": 166, \\\"useless\\\": 97, \\\"superb\\\": 98, \\\"smartphone\\\": 164, \\\"satisfied\\\": 113, \\\"with\\\": 222, \\\"purchase\\\": 196, \\\"i\\\": 224, \\\"love\\\": 121, \\\"keyboard\\\": 157, \\\"highly\\\": 92, \\\"recommended\\\": 92, \\\"awful\\\": 114, \\\"brilliant\\\": 106, \\\"better\\\": 216, \\\"than\\\": 111, \\\"on\\\": 103, \\\"amazing\\\": 134, \\\"will\\\": 117, \\\"buy\\\": 117, \\\"again\\\": 117, \\\"powerbank\\\": 147, \\\"average\\\": 194, \\\"basic\\\": 231, \\\"router\\\": 182, \\\"smartwatch\\\": 166, \\\"hard\\\": 144, \\\"drive\\\": 144, \\\"disappointing\\\": 103, \\\"meets\\\": 106, \\\"requirements\\\": 106, \\\"stay\\\": 104, \\\"away\\\": 104, \\\"from\\\": 104, \\\"excellent\\\": 142, \\\"great\\\": 351, \\\"crystal\\\": 6, \\\"clear\\\": 6, \\\"display\\\": 6, \\\"outstanding\\\": 117, \\\"cable\\\": 163, \\\"misleading\\\": 100, \\\"okay\\\": 122, \\\"could\\\": 105, \\\"be\\\": 195, \\\"best\\\": 93, \\\"ive\\\": 93, \\\"used\\\": 93, \\\"tablet\\\": 147, \\\"every\\\": 126, \\\"penny\\\": 126, \\\"mouse\\\": 139, \\\"build\\\": 12, \\\"serves\\\": 97, \\\"its\\\": 97, \\\"purpose\\\": 97, \\\"described\\\": 124, \\\"exactly\\\": 103, \\\"what\\\": 103, \\\"wanted\\\": 103, \\\"value\\\": 118, \\\"couldnt\\\": 90, \\\"happier\\\": 90, \\\"fast\\\": 10, \\\"processing\\\": 10, \\\"premium\\\": 13, \\\"feel\\\": 13, \\\"beautiful\\\": 8, \\\"design\\\": 8, \\\"battery\\\": 19, \\\"life\\\": 19, \\\"innovative\\\": 16, \\\"comfortable\\\": 9, \\\"to\\\": 9, \\\"use\\\": 9, \\\"performance\\\": 16, \\\"reliable\\\": 3}\", \"word_docs\": \"{\\\"wonderful\\\": 106, \\\"my\\\": 246, \\\"exceeded\\\": 113, \\\"expectations\\\": 113, \\\"printer\\\": 175, \\\"perfect\\\": 133, \\\"speaker\\\": 157, \\\"needs\\\": 133, \\\"fantastic\\\": 115, \\\"for\\\": 352, \\\"acceptable\\\": 219, \\\"headphones\\\": 163, \\\"quality\\\": 409, \\\"earphones\\\": 163, \\\"standard\\\": 200, \\\"special\\\": 100, \\\"nothing\\\": 100, \\\"this\\\": 758, \\\"webcam\\\": 153, \\\"recommend\\\": 95, \\\"buying\\\": 114, \\\"regret\\\": 188, \\\"not\\\": 533, \\\"would\\\": 95, \\\"very\\\": 322, \\\"disappointed\\\": 109, \\\"horrible\\\": 111, \\\"the\\\": 510, \\\"decent\\\": 191, \\\"bad\\\": 294, \\\"price\\\": 217, \\\"laptop\\\": 193, \\\"memory\\\": 163, \\\"card\\\": 163, \\\"usual\\\": 81, \\\"as\\\": 237, \\\"expected\\\": 224, \\\"experience\\\": 90, \\\"terrible\\\": 190, \\\"poor\\\": 193, \\\"monitor\\\": 156, \\\"is\\\": 456, \\\"camera\\\": 148, \\\"fine\\\": 108, \\\"charger\\\": 154, \\\"features\\\": 133, \\\"worth\\\": 242, \\\"money\\\": 316, \\\"waste\\\": 198, \\\"of\\\": 198, \\\"complete\\\": 108, \\\"worst\\\": 94, \\\"ever\\\": 187, \\\"regular\\\": 100, \\\"microphone\\\": 166, \\\"useless\\\": 97, \\\"smartphone\\\": 164, \\\"purchase\\\": 196, \\\"with\\\": 213, \\\"satisfied\\\": 113, \\\"superb\\\": 98, \\\"i\\\": 213, \\\"love\\\": 121, \\\"highly\\\": 92, \\\"keyboard\\\": 157, \\\"recommended\\\": 92, \\\"awful\\\": 114, \\\"better\\\": 216, \\\"than\\\": 111, \\\"brilliant\\\": 106, \\\"on\\\": 103, \\\"will\\\": 117, \\\"amazing\\\": 134, \\\"buy\\\": 117, \\\"again\\\": 117, \\\"powerbank\\\": 147, \\\"average\\\": 184, \\\"router\\\": 182, \\\"basic\\\": 221, \\\"smartwatch\\\": 166, \\\"drive\\\": 144, \\\"hard\\\": 144, \\\"disappointing\\\": 103, \\\"meets\\\": 106, \\\"requirements\\\": 106, \\\"away\\\": 104, \\\"stay\\\": 104, \\\"from\\\": 104, \\\"excellent\\\": 142, \\\"crystal\\\": 6, \\\"great\\\": 316, \\\"display\\\": 6, \\\"clear\\\": 6, \\\"outstanding\\\": 117, \\\"cable\\\": 163, \\\"misleading\\\": 100, \\\"okay\\\": 122, \\\"be\\\": 195, \\\"could\\\": 105, \\\"best\\\": 93, \\\"ive\\\": 93, \\\"used\\\": 93, \\\"tablet\\\": 147, \\\"every\\\": 126, \\\"penny\\\": 126, \\\"mouse\\\": 139, \\\"build\\\": 12, \\\"serves\\\": 97, \\\"purpose\\\": 97, \\\"its\\\": 97, \\\"described\\\": 124, \\\"exactly\\\": 103, \\\"wanted\\\": 103, \\\"what\\\": 103, \\\"value\\\": 118, \\\"couldnt\\\": 90, \\\"happier\\\": 90, \\\"fast\\\": 10, \\\"processing\\\": 10, \\\"premium\\\": 13, \\\"feel\\\": 13, \\\"beautiful\\\": 8, \\\"design\\\": 8, \\\"life\\\": 19, \\\"battery\\\": 19, \\\"innovative\\\": 16, \\\"comfortable\\\": 9, \\\"to\\\": 9, \\\"use\\\": 9, \\\"performance\\\": 16, \\\"reliable\\\": 3}\", \"index_docs\": \"{\\\"80\\\": 106, \\\"11\\\": 246, \\\"72\\\": 113, \\\"73\\\": 113, \\\"34\\\": 175, \\\"56\\\": 133, \\\"43\\\": 157, \\\"57\\\": 133, \\\"69\\\": 115, \\\"6\\\": 352, \\\"15\\\": 219, \\\"38\\\": 163, \\\"5\\\": 409, \\\"39\\\": 163, \\\"21\\\": 200, \\\"94\\\": 100, \\\"93\\\": 100, \\\"1\\\": 758, \\\"47\\\": 153, \\\"103\\\": 95, \\\"70\\\": 114, \\\"26\\\": 188, \\\"2\\\": 533, \\\"102\\\": 95, \\\"9\\\": 322, \\\"77\\\": 109, \\\"75\\\": 111, \\\"3\\\": 510, \\\"25\\\": 191, \\\"10\\\": 294, \\\"19\\\": 217, \\\"31\\\": 193, \\\"40\\\": 163, \\\"41\\\": 163, \\\"113\\\": 81, \\\"13\\\": 237, \\\"16\\\": 224, \\\"110\\\": 90, \\\"28\\\": 190, \\\"24\\\": 193, \\\"45\\\": 156, \\\"4\\\": 456, \\\"48\\\": 148, \\\"78\\\": 108, \\\"46\\\": 154, \\\"58\\\": 133, \\\"12\\\": 242, \\\"8\\\": 316, \\\"22\\\": 198, \\\"23\\\": 198, \\\"79\\\": 108, \\\"104\\\": 94, \\\"32\\\": 187, \\\"95\\\": 100, \\\"35\\\": 166, \\\"98\\\": 97, \\\"37\\\": 164, \\\"27\\\": 196, \\\"18\\\": 213, \\\"74\\\": 113, \\\"97\\\": 98, \\\"17\\\": 213, \\\"63\\\": 121, \\\"108\\\": 92, \\\"44\\\": 157, \\\"109\\\": 92, \\\"71\\\": 114, \\\"20\\\": 216, \\\"76\\\": 111, \\\"81\\\": 106, \\\"88\\\": 103, \\\"65\\\": 117, \\\"55\\\": 134, \\\"66\\\": 117, \\\"67\\\": 117, \\\"49\\\": 147, \\\"30\\\": 184, \\\"33\\\": 182, \\\"14\\\": 221, \\\"36\\\": 166, \\\"52\\\": 144, \\\"51\\\": 144, \\\"89\\\": 103, \\\"82\\\": 106, \\\"83\\\": 106, \\\"86\\\": 104, \\\"85\\\": 104, \\\"87\\\": 104, \\\"53\\\": 142, \\\"128\\\": 6, \\\"7\\\": 316, \\\"130\\\": 6, \\\"129\\\": 6, \\\"68\\\": 117, \\\"42\\\": 163, \\\"96\\\": 100, \\\"62\\\": 122, \\\"29\\\": 195, \\\"84\\\": 105, \\\"105\\\": 93, \\\"106\\\": 93, \\\"107\\\": 93, \\\"50\\\": 147, \\\"59\\\": 126, \\\"60\\\": 126, \\\"54\\\": 139, \\\"120\\\": 12, \\\"99\\\": 97, \\\"101\\\": 97, \\\"100\\\": 97, \\\"61\\\": 124, \\\"90\\\": 103, \\\"92\\\": 103, \\\"91\\\": 103, \\\"64\\\": 118, \\\"111\\\": 90, \\\"112\\\": 90, \\\"121\\\": 10, \\\"122\\\": 10, \\\"118\\\": 13, \\\"119\\\": 13, \\\"126\\\": 8, \\\"127\\\": 8, \\\"115\\\": 19, \\\"114\\\": 19, \\\"116\\\": 16, \\\"123\\\": 9, \\\"124\\\": 9, \\\"125\\\": 9, \\\"117\\\": 16, \\\"131\\\": 3}\", \"index_word\": \"{\\\"1\\\": \\\"this\\\", \\\"2\\\": \\\"not\\\", \\\"3\\\": \\\"the\\\", \\\"4\\\": \\\"is\\\", \\\"5\\\": \\\"quality\\\", \\\"6\\\": \\\"for\\\", \\\"7\\\": \\\"great\\\", \\\"8\\\": \\\"money\\\", \\\"9\\\": \\\"very\\\", \\\"10\\\": \\\"bad\\\", \\\"11\\\": \\\"my\\\", \\\"12\\\": \\\"worth\\\", \\\"13\\\": \\\"as\\\", \\\"14\\\": \\\"basic\\\", \\\"15\\\": \\\"acceptable\\\", \\\"16\\\": \\\"expected\\\", \\\"17\\\": \\\"i\\\", \\\"18\\\": \\\"with\\\", \\\"19\\\": \\\"price\\\", \\\"20\\\": \\\"better\\\", \\\"21\\\": \\\"standard\\\", \\\"22\\\": \\\"waste\\\", \\\"23\\\": \\\"of\\\", \\\"24\\\": \\\"poor\\\", \\\"25\\\": \\\"decent\\\", \\\"26\\\": \\\"regret\\\", \\\"27\\\": \\\"purchase\\\", \\\"28\\\": \\\"terrible\\\", \\\"29\\\": \\\"be\\\", \\\"30\\\": \\\"average\\\", \\\"31\\\": \\\"laptop\\\", \\\"32\\\": \\\"ever\\\", \\\"33\\\": \\\"router\\\", \\\"34\\\": \\\"printer\\\", \\\"35\\\": \\\"microphone\\\", \\\"36\\\": \\\"smartwatch\\\", \\\"37\\\": \\\"smartphone\\\", \\\"38\\\": \\\"headphones\\\", \\\"39\\\": \\\"earphones\\\", \\\"40\\\": \\\"memory\\\", \\\"41\\\": \\\"card\\\", \\\"42\\\": \\\"cable\\\", \\\"43\\\": \\\"speaker\\\", \\\"44\\\": \\\"keyboard\\\", \\\"45\\\": \\\"monitor\\\", \\\"46\\\": \\\"charger\\\", \\\"47\\\": \\\"webcam\\\", \\\"48\\\": \\\"camera\\\", \\\"49\\\": \\\"powerbank\\\", \\\"50\\\": \\\"tablet\\\", \\\"51\\\": \\\"hard\\\", \\\"52\\\": \\\"drive\\\", \\\"53\\\": \\\"excellent\\\", \\\"54\\\": \\\"mouse\\\", \\\"55\\\": \\\"amazing\\\", \\\"56\\\": \\\"perfect\\\", \\\"57\\\": \\\"needs\\\", \\\"58\\\": \\\"features\\\", \\\"59\\\": \\\"every\\\", \\\"60\\\": \\\"penny\\\", \\\"61\\\": \\\"described\\\", \\\"62\\\": \\\"okay\\\", \\\"63\\\": \\\"love\\\", \\\"64\\\": \\\"value\\\", \\\"65\\\": \\\"will\\\", \\\"66\\\": \\\"buy\\\", \\\"67\\\": \\\"again\\\", \\\"68\\\": \\\"outstanding\\\", \\\"69\\\": \\\"fantastic\\\", \\\"70\\\": \\\"buying\\\", \\\"71\\\": \\\"awful\\\", \\\"72\\\": \\\"exceeded\\\", \\\"73\\\": \\\"expectations\\\", \\\"74\\\": \\\"satisfied\\\", \\\"75\\\": \\\"horrible\\\", \\\"76\\\": \\\"than\\\", \\\"77\\\": \\\"disappointed\\\", \\\"78\\\": \\\"fine\\\", \\\"79\\\": \\\"complete\\\", \\\"80\\\": \\\"wonderful\\\", \\\"81\\\": \\\"brilliant\\\", \\\"82\\\": \\\"meets\\\", \\\"83\\\": \\\"requirements\\\", \\\"84\\\": \\\"could\\\", \\\"85\\\": \\\"stay\\\", \\\"86\\\": \\\"away\\\", \\\"87\\\": \\\"from\\\", \\\"88\\\": \\\"on\\\", \\\"89\\\": \\\"disappointing\\\", \\\"90\\\": \\\"exactly\\\", \\\"91\\\": \\\"what\\\", \\\"92\\\": \\\"wanted\\\", \\\"93\\\": \\\"nothing\\\", \\\"94\\\": \\\"special\\\", \\\"95\\\": \\\"regular\\\", \\\"96\\\": \\\"misleading\\\", \\\"97\\\": \\\"superb\\\", \\\"98\\\": \\\"useless\\\", \\\"99\\\": \\\"serves\\\", \\\"100\\\": \\\"its\\\", \\\"101\\\": \\\"purpose\\\", \\\"102\\\": \\\"would\\\", \\\"103\\\": \\\"recommend\\\", \\\"104\\\": \\\"worst\\\", \\\"105\\\": \\\"best\\\", \\\"106\\\": \\\"ive\\\", \\\"107\\\": \\\"used\\\", \\\"108\\\": \\\"highly\\\", \\\"109\\\": \\\"recommended\\\", \\\"110\\\": \\\"experience\\\", \\\"111\\\": \\\"couldnt\\\", \\\"112\\\": \\\"happier\\\", \\\"113\\\": \\\"usual\\\", \\\"114\\\": \\\"battery\\\", \\\"115\\\": \\\"life\\\", \\\"116\\\": \\\"innovative\\\", \\\"117\\\": \\\"performance\\\", \\\"118\\\": \\\"premium\\\", \\\"119\\\": \\\"feel\\\", \\\"120\\\": \\\"build\\\", \\\"121\\\": \\\"fast\\\", \\\"122\\\": \\\"processing\\\", \\\"123\\\": \\\"comfortable\\\", \\\"124\\\": \\\"to\\\", \\\"125\\\": \\\"use\\\", \\\"126\\\": \\\"beautiful\\\", \\\"127\\\": \\\"design\\\", \\\"128\\\": \\\"crystal\\\", \\\"129\\\": \\\"clear\\\", \\\"130\\\": \\\"display\\\", \\\"131\\\": \\\"reliable\\\"}\", \"word_index\": \"{\\\"this\\\": 1, \\\"not\\\": 2, \\\"the\\\": 3, \\\"is\\\": 4, \\\"quality\\\": 5, \\\"for\\\": 6, \\\"great\\\": 7, \\\"money\\\": 8, \\\"very\\\": 9, \\\"bad\\\": 10, \\\"my\\\": 11, \\\"worth\\\": 12, \\\"as\\\": 13, \\\"basic\\\": 14, \\\"acceptable\\\": 15, \\\"expected\\\": 16, \\\"i\\\": 17, \\\"with\\\": 18, \\\"price\\\": 19, \\\"better\\\": 20, \\\"standard\\\": 21, \\\"waste\\\": 22, \\\"of\\\": 23, \\\"poor\\\": 24, \\\"decent\\\": 25, \\\"regret\\\": 26, \\\"purchase\\\": 27, \\\"terrible\\\": 28, \\\"be\\\": 29, \\\"average\\\": 30, \\\"laptop\\\": 31, \\\"ever\\\": 32, \\\"router\\\": 33, \\\"printer\\\": 34, \\\"microphone\\\": 35, \\\"smartwatch\\\": 36, \\\"smartphone\\\": 37, \\\"headphones\\\": 38, \\\"earphones\\\": 39, \\\"memory\\\": 40, \\\"card\\\": 41, \\\"cable\\\": 42, \\\"speaker\\\": 43, \\\"keyboard\\\": 44, \\\"monitor\\\": 45, \\\"charger\\\": 46, \\\"webcam\\\": 47, \\\"camera\\\": 48, \\\"powerbank\\\": 49, \\\"tablet\\\": 50, \\\"hard\\\": 51, \\\"drive\\\": 52, \\\"excellent\\\": 53, \\\"mouse\\\": 54, \\\"amazing\\\": 55, \\\"perfect\\\": 56, \\\"needs\\\": 57, \\\"features\\\": 58, \\\"every\\\": 59, \\\"penny\\\": 60, \\\"described\\\": 61, \\\"okay\\\": 62, \\\"love\\\": 63, \\\"value\\\": 64, \\\"will\\\": 65, \\\"buy\\\": 66, \\\"again\\\": 67, \\\"outstanding\\\": 68, \\\"fantastic\\\": 69, \\\"buying\\\": 70, \\\"awful\\\": 71, \\\"exceeded\\\": 72, \\\"expectations\\\": 73, \\\"satisfied\\\": 74, \\\"horrible\\\": 75, \\\"than\\\": 76, \\\"disappointed\\\": 77, \\\"fine\\\": 78, \\\"complete\\\": 79, \\\"wonderful\\\": 80, \\\"brilliant\\\": 81, \\\"meets\\\": 82, \\\"requirements\\\": 83, \\\"could\\\": 84, \\\"stay\\\": 85, \\\"away\\\": 86, \\\"from\\\": 87, \\\"on\\\": 88, \\\"disappointing\\\": 89, \\\"exactly\\\": 90, \\\"what\\\": 91, \\\"wanted\\\": 92, \\\"nothing\\\": 93, \\\"special\\\": 94, \\\"regular\\\": 95, \\\"misleading\\\": 96, \\\"superb\\\": 97, \\\"useless\\\": 98, \\\"serves\\\": 99, \\\"its\\\": 100, \\\"purpose\\\": 101, \\\"would\\\": 102, \\\"recommend\\\": 103, \\\"worst\\\": 104, \\\"best\\\": 105, \\\"ive\\\": 106, \\\"used\\\": 107, \\\"highly\\\": 108, \\\"recommended\\\": 109, \\\"experience\\\": 110, \\\"couldnt\\\": 111, \\\"happier\\\": 112, \\\"usual\\\": 113, \\\"battery\\\": 114, \\\"life\\\": 115, \\\"innovative\\\": 116, \\\"performance\\\": 117, \\\"premium\\\": 118, \\\"feel\\\": 119, \\\"build\\\": 120, \\\"fast\\\": 121, \\\"processing\\\": 122, \\\"comfortable\\\": 123, \\\"to\\\": 124, \\\"use\\\": 125, \\\"beautiful\\\": 126, \\\"design\\\": 127, \\\"crystal\\\": 128, \\\"clear\\\": 129, \\\"display\\\": 130, \\\"reliable\\\": 131}\"}}"